#include <stdio.h>
#include <stdlib.h>
#include <math.h>
struct Ratio //структура ратіо ( я не використовувала структуру, але в завданні написано її створити)
{
	int nom; //змінна ном 
	long den; //змінна ден
};

double ChainFraqcreateN(double x,int num) //функція для переведення дробу в ланцюговий дріб
{
	int *a; //динамічний масив для коефіцієнтів
	a = (int*) malloc(num * sizeof(int)); //розмір динамічного массиву
	if(num!=0)
	{
	}
	else
	{
		a = (int*) realloc(a, (int)x * sizeof(int)); //додаємо перший коефіцієнт в масив по формулі
		x=x-a[0]; //формула для першого коефіцієнту
		num=1; //збільшення номеру лічильника
		do //цикл для додавання інших коефіцієнтів в массив
			{
				a = (int*) realloc(a, (int)(1.0/x) * sizeof(int)); //додаємо наступний коефіцієнт в массив
				x=1.0/x-a[num]; //формула для наступного коефіцієнта
				num++; //збільшення номеру лічильника
				printf("%i",a[num-1]); //виведення коефіцієнтів 
				printf("+1");
			}
			while(x==0.0); //кінець циклу 
		}
		return num;
	}	
	double ChainFraqcreate(double x,double eps) //функція для знаходження точності представлення ланцюгового дробу
	{
		eps=fabs(x-(int)x); //формула для знаходження точності представлення дробу
		printf("%f",eps); //вивід точності представлення дробу
		return eps;
	}	
int main()
{
	float x,eps=0,o,num=100; //змінні для числа, точності представлення і вибору функції та лічильника коефіцієнтів
	int *a;//массив коефіцієнтів
	printf("viberit iak bydete voditi chislo natisnit 1 iaksho za dopomogoy chisla natusnit 2 iaksho za dopomogoy kofizientiv\n"); //виводимо питання для користувача як саме вводити число
	scanf("%f",&o); //введення вибору введення числа
	if(o==1) //якщо користувач вибрав вводити сбособом дробу
	{
		printf("vvedit chuslo\n"); //питання для введеня числа
		scanf("%f",&x); //введення числа
		int num;
		num=0;
		ChainFraqcreateN(x,num); //визиваємо функію для обрахунку коефіцієнтів
		ChainFraqcreate(x,eps); //визиваємо функцію для обрахунку точності представлення
	}
	else if(o==2) //якщо користувач вибрав представлення дробу за допомогою коефіцієнтів
	{
		printf("vedit koeficienti\n"); //виведення запиту коефіцієнтів
		a = (int*) malloc(num * sizeof(int)); //динамічний массив для коефіцієнтів
		int y=0,k; //змінні для номерів коефіцієнтів і для коефіцієнтів
		do
		{
			int y=0;
			printf("%i",y); //виведення номера коефіцієнта
			printf("=");
			scanf("%i",&k); //введення коефіцієнта
			a = (int*) realloc(a, k * sizeof(int)); //додавання коефіцієнта до массиву
			y++;//лічильник номеру коефіцієнта
		}
		while(k==0); //виконуємо поки коефіцієнт не буде = 0 
		do
		{
			printf("%i",a[y]);  //виведеня раціонального числа за допомогою коефіцієнтів
			printf("+1");
			y++;
		}
		while(a[y]==0);  //виконуємо поки коефіцієнт не буде = 0
	}
	else
	{
		printf("pomilka"); //якщо користувач вводить невірне число не 1 і не 2 то помилка
	}
	char output(ChainFraqcreateN(x,num));  //переведення даних в чар
	char output(ChainFraqcreate(x,eps));
}
